In [6]:
import sqlite3
#creamos un archivo db llamdo company
connection = sqlite3.connect("company.db")
cursor = connection.cursor()

In [7]:
sql_command = """
CREATE TABLE employee ( 
staff_number INTEGER PRIMARY KEY, 
fname VARCHAR(20), 
lname VARCHAR(30), 
gender CHAR(1), 
joining DATE,
birth_date DATE);"""
cursor.execute(sql_command)

In [8]:
sql_command = """INSERT INTO employee (staff_number, fname, lname, gender, birth_date)
    VALUES (NULL, "William", "Shakespeare", "m", "1961-10-25");"""
cursor.execute(sql_command)

In [13]:
sql_command = """INSERT INTO employee (staff_number, fname, lname, gender, birth_date)
    VALUES (NULL, "Frank", "Schiller", "m", "1955-08-17");"""
cursor.execute(sql_command)

sql_command = """INSERT INTO employee (staff_number, fname, lname, gender, birth_date)
    VALUES (NULL, "Paloma", "Cimental", "f", "1994-10-07");"""
cursor.execute(sql_command)

# para salvar los cambios hacemos:
connection.commit()

connection.close()

In [11]:
import sqlite3
connection = sqlite3.connect("company.db")

cursor = connection.cursor()

staff_data = [ ("William", "Shakespeare", "m", "1961-10-25"),
               ("Frank", "Schiller", "m", "1955-08-17"),
               ("Jane", "Wall", "f", "1989-03-14") ]
               
for p in staff_data:
    format_str = """INSERT INTO employee (staff_number, fname, lname, gender, birth_date)
    VALUES (NULL, "{first}", "{last}", "{gender}", "{birthdate}");"""

    sql_command = format_str.format(first=p[0], last=p[1], gender=p[2], birthdate = p[3])
    cursor.execute(sql_command)

In [12]:
import sqlite3
connection = sqlite3.connect("company.db")

cursor = connection.cursor()

cursor.execute("SELECT * FROM employee") 
print("fetchall:")
result = cursor.fetchall() 
for r in result:
    print(r)
cursor.execute("SELECT * FROM employee") 
print("\nfetch one:")
res = cursor.fetchone() 
print(res)

fetchall:
(1, 'William', 'Shakespeare', 'm', None, '1961-10-25')
(2, 'Frank', 'Schiller', 'm', None, '1955-08-17')

fetch one:
(1, 'William', 'Shakespeare', 'm', None, '1961-10-25')

In [19]:
import sqlite3
import pandas as pd

conn = sqlite3.connect("company.db")
cur = conn.cursor()

In [20]:
coords = cur.execute("""
select fname,
lname
from employee;""").fetchall()
print(coords)

[('William', 'Shakespeare'), ('Frank', 'Schiller'), ('Frank', 'Schiller'), ('Paloma', 'Cimental')]

In [21]:
df = pd.read_sql_query("select * from employee limit 4;", conn)
df

   staff_number    fname        lname gender joining  birth_date
0             1  William  Shakespeare      m    None  1961-10-25
1             2    Frank     Schiller      m    None  1955-08-17
2             3    Frank     Schiller      m    None  1955-08-17
3             4   Paloma     Cimental      f    None  1994-10-07